# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

channels: 4
ch: 4
backbone:
  - [-1, 1, Silence, []]  # 0
  # visible
  - [0, 1, SilenceChannel, [0,3]]  # 1
  - [-1, 1, Conv, [64, 3, 2]] # 2
  - [-1, 1, Conv, [128, 3, 2]] # 3
  - [-1, 2, C3k2, [256, False, 0.25]] # 4
  - [-1, 1, Conv, [256, 3, 2]] # 5
  - [-1, 2, C3k2, [512, False, 0.25]] # 6 RGB P3

  # infrared
  - [0, 1, SilenceChannel, [3,4]]  # 7
  - [-1, 1, Conv, [64, 3, 2]] # 8
  - [-1, 1, Conv, [128, 3, 2]] # 9
  - [-1, 2, C3k2, [256, False, 0.25]] # 10
  - [-1, 1, Conv, [256, 3, 2]] # 11
  - [-1, 2, C3k2, [512, False, 0.25]] # 12 IR P3

  # Align IR to the RGB coordinate system, then use Q/K=RGB and V=IR_aligned.
  - [[12, 6], 1, OffsetGuidedDeformableAlignment, [3, 16, 4.0, 2.0, True, False]] # 13 IR_aligned P3
  - [[6, 13], 1, IRValueGuidedRGBEnhancement, []] # 14 enhanced RGB P3
  - [[14, 13], 1, Concat, [1]] # 15 concat enhanced RGB + aligned IR
  - [-1, 1, Conv, [512, 1, 1]] # 16 P3/8

  - [-1, 1, Conv, [512, 3, 2]] # 17 P4/16
  - [-1, 2, C3k2, [512, True]] # 18
  - [-1, 1, Conv, [1024, 3, 2]] # 19 P5/32
  - [-1, 2, C3k2, [1024, True]] # 20
  - [-1, 1, SPPF, [1024, 5]] # 21
  - [-1, 2, C2PSA, [1024]] # 22

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 25

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]] # 28

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 25], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 31

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 22], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]] # 34

  - [[28, 31, 34], 1, OBB, [nc, 1]]
