# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

channels: 4
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []]  # 0
  # visible
  - [0, 1, SilenceChannel, [0,3]]  # 1
  - [-1, 1, Conv, [64, 3, 2]] # 2
  - [-1, 1, Conv, [128, 3, 2]] # 3
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 5
  - [-1, 2, C3k2, [512, False, 0.25]] # 6 RGB P3
  - [-1, 1, Conv, [512, 3, 2]] # 7
  - [-1, 2, C3k2, [512, True]] # 8 RGB P4
  - [-1, 1, Conv, [1024, 3, 2]] # 9
  - [-1, 2, C3k2, [1024, True]] # 10 RGB P5

  # infrared
  - [0, 1, SilenceChannel, [3,4]]  # 11
  - [-1, 1, Conv, [64, 3, 2]] # 12
  - [-1, 1, Conv, [128, 3, 2]] # 13
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 15
  - [-1, 2, C3k2, [512, False, 0.25]] # 16 IR P3
  - [-1, 1, Conv, [512, 3, 2]] # 17
  - [-1, 2, C3k2, [512, True]] # 18 IR P4
  - [-1, 1, Conv, [1024, 3, 2]] # 19
  - [-1, 2, C3k2, [1024, True]]  # 20 IR P5

  # Single-direction full-scale fusion.
  # Enhance RGB with IR: Q=RGB, K/V=IR, then concat enhanced RGB with original IR.
  - [[6, 16], 1, IRGuidedRGBEnhancement, []]  # 21 enhanced RGB P3
  - [[21, 16], 1, Concat, [1]]  # 22 P3 fusion
  - [[8, 18], 1, IRGuidedRGBEnhancement, []]  # 23 enhanced RGB P4
  - [[23, 18], 1, Concat, [1]]  # 24 P4 fusion
  - [[10, 20], 1, IRGuidedRGBEnhancement, []]  # 25 enhanced RGB P5
  - [[25, 20], 1, Concat, [1]]  # 26 P5 fusion

  - [-1, 1, SPPF, [1024, 5]] # 27
  - [-1, 2, C2PSA, [1024]] # 28

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 24], 1, Concat, [1]] # cat enhanced backbone P4
  - [-1, 2, C3k2, [512, False]] # 31

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 22], 1, Concat, [1]] # cat enhanced backbone P3
  - [-1, 2, C3k2, [256, False]] # 34

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 31], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 37

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 28], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]] # 40

  - [[34, 37, 40], 1, OBB, [nc, 1]]
